TITLE ЛР_4 
;------------------------------------------------------------------------------
;ЛР  №4
;------------------------------------------------------------------------------
;------------------------------------I.ЗАГОЛОВОК ПРОГРАМИ--------------------------
IDEAL			; Директива - тип Асемблера tasm 
MODEL small 	; Директива - тип моделі пам’яті 
STACK 4096		; Директива - розмір стеку 
;---------------------------------------------II.МАКРОСИ---------------------------
;Макрос ініцілізації
MACRO M_Init
mov ax, @data
mov ds, ax
mov es, ax
ENDM M_Init
;--------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ--------------
DATASEG
;Оголошення двовимірного масиву 16х16
arr_stack DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		Dw  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '2', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6'
		DW  '3', '4', '8', '9', '7', '3', '0', '3', '9', '0', '7', '6', '1', '0', '8', '6' 
exCode DB 0
CODESEG
;----------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ-------------------
Start:
M_Init

xor si,si
	
	;Копіювання масиву 
    proc copy
		mov cx, 256
		L1:
			mov bx, [ds:si]
			mov [ds:si+120h], bx
			add si,2
			loop L1
		mov cx, 256
		L2:
			mov bx, [ds:si]
			mov [ds:si+120h], bx
			add si,2
			loop L2
		mov cx, 256
		L3:
			mov bx, [ds:si]
			mov [ds:si+120h], bx
			add si,2
			loop L3
		mov cx, 256
		L4:
			mov bx, [ds:si]
			mov [ds:si+120h], bx
			add si,2
			loop L4
		mov cx, 256
		L5:
			mov bx, [ds:si]
			mov [ds:si+120h], bx
			add si,2
			loop L5
		mov cx, 256
	endp copy 

	;Копіювання до стеку
	mov cx, 256
	xor si, si                       
    stackLoop:
        mov bx,[ds:si]             
        push bx                      
        add si, 2                    
        loop stackLoop

Exit:
	mov ah,04ch
	mov al,[exCode]			; отримання коду виходу 
	int 21h				; виклик функції DOS 4ch
	
end Start