TITLE ЛР_1 
;------------------------------------------------------------------------------
;ЛР  №1.1
;------------------------------------------------------------------------------
; Програмування 3. Системне програмування
; Завдання:              Основи розробки і налагодження
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:          1
; Група:      	IT-01
;------------------------------------------------------------------------------
; Автор:        __ __ __
; Дата:         __/__/__
;---------------------------------
				;I.ЗАГОЛОВОК ПРОГРАМИ
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 256		; Директива - розмір стеку 
				;II.МАКРОСИ
				;III.ПОЧАТОК СЕГ arr_rnd1МЕНТУ ДАНИХ
DATASEG
exCode db 0
hello db "Hello World!",10,13,'$'
shevchuk db "Shevchuk",10,13,'$'
tonkui db "Tonkui",10,13,'$'
tumoshenko db "Tumoshenko",10,13,'$'
CODESEG
Start:
;--------------------------------- 1. Ініціалізація DS и ES---------------------------------------
	mov ax,@data	; @data ідентифікатор, що створюються директивою model
	mov ds, ax	; Завантаження початку сегменту даних в регістр ds
	mov es, ax	; Завантаження початку сегменту даних в регістр es
;----------------------------------2. Операція виводу на консоль---------------------------------
	mov ah,09h
				; Пересилання адреси рядка символів message в регістр dx
	mov dx, offset hello
				; Завантаження числа 09h до регістру ah
				; (Функція DOS 9h - команда виводу на консоль рядка)
	int 21h		; Виклик функції DOS 9h
				; Пересилання адреси рядка символів message в регістр dx
	mov dx, offset shevchuk
				; Завантаження числа 09h до регістру ah
				; (Функція DOS 9h - команда виводу на консоль рядка)
	int 21h		; Виклик функції DOS 9h
	int 21h
	int 21h
				; Пересилання адреси рядка символів message в регістр dx
	mov dx, offset tonkui
				; Завантаження числа 09h до регістру ah
				; (Функція DOS 9h - команда виводу на консоль рядка)
	int 21h		; Виклик функції DOS 9
				; Пересилання адреси рядка символів message в регістр dx
	mov dx, offset tumoshenko
				; Завантаження числа 09h до регістру ah
				; (Функція DOS 9h - команда виводу на консоль рядка)
	int 21h		; Виклик функції DOS 9h
;----------------------------------3. Операція зупинки програми, очікування натискання клавіш-----
	mov ah,01h
			; Завантаження числа 01h до регістру ah
			; (Функція DOS 1h - команда очікування натискання клавіші...)
	int 21h		; Виклик функції DOS 1h
			; Завантаження числа 4ch до регістру ah
			; (Функція DOS 4ch - виходу з програми)
;---------------------------------4. Вихід з програми---------------------------------------------
	mov ah,4ch
	mov al,[exCode]	; отримання коду виходу 
	int 21h		; виклик функції DOS 4ch
	end Start
  
DOS 4ch
	end Start